# Power Users

We define as power users those users who bought at least 10 products. Write a query that returns for each user on which day they became a power user. That is, for each user, on which day they bought the 10th item.

The table below represents transactions. That is, each row means that the corresponding user has bought something on that date.

In [1]:
import pandas as pd
url = 'https://raw.githubusercontent.com/data-eng-10-21/interview-questions/main/ds-sql/1-power-users/query_three.csv'
df = pd.read_csv(url, index_col = 0)

In [2]:
import sqlite3

conn = sqlite3.connect('power_users.db')

In [3]:
df.to_sql('users', conn, if_exists = 'replace')

In [4]:
pd.read_sql('select * from users', conn)

       user_id                 date
0          675  2014-12-31 16:16:12
1         1967  2014-12-31 16:37:57
2           57  2014-12-31 17:05:32
3         1532  2014-12-31 17:26:25
4         1831  2014-12-31 18:20:54
...        ...                  ...
19995     1656  2015-12-30 13:18:16
19996      381  2015-12-30 14:31:49
19997     1891  2015-12-30 15:10:35
19998      977  2015-12-30 15:30:15
19999     1076  2015-12-30 15:59:38

[20000 rows x 2 columns]

In [15]:
pd.read_sql(""" (select user_id, date, count(user_id) over (partition by user_id order by date) num_purchases from users)
""", conn)

       user_id                 date  num_purchases
0            1  2015-01-31 21:37:48              1
1            1  2015-02-27 02:53:09              2
2            1  2015-04-06 02:54:19              3
3            1  2015-04-15 05:30:11              4
4            1  2015-05-01 18:21:40              5
...        ...                  ...            ...
19995     2000  2015-03-07 18:57:02              1
19996     2000  2015-08-12 08:47:07              2
19997     2000  2015-09-15 23:14:38              3
19998     2000  2015-10-16 01:55:24              4
19999     2000  2015-12-26 20:10:23              5

[20000 rows x 3 columns]

### Answer

<img src="./user-date.png" width="40%">